### Import the necessary libraries

In [44]:

!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in /Users/javiercabrera/opt/anaconda3/lib/python3.8/site-packages (1.3.20)
Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.1 MB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [38]:
import pandas as pd
import sqlalchemy as alch
import getpass as getpass

#your code here

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [40]:
from getpass import getpass

In [41]:
#Your code here
user = 'admin'
password = getpass('introduce to password')
#user 
#password

introduce to password········

### Establishes the connection to the database

In [42]:

dbName="publications"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [35]:
#Your code here 
#dbName
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
#connectionData=f"mysql+pymysql://{user}:{password}@localhost/{dbName}"

### Remember to create the engine

In [45]:
#Your code here
#engine
engine = alch.create_engine(connectionData)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [84]:
df1 = pd.read_sql_query('''
select pub_name, title, title_id
from publishers
left join titles 
on publishers.pub_id = titles.pub_id;
''', engine)

In [85]:
df1.head()

,pub_name,title,title_id,ytd_sales
0,New Moon Books,You Can Combat Computer Stress!,BU2075,18722.0
1,New Moon Books,Is Anger the Enemy?,PS2091,2045.0
2,New Moon Books,Life Without Fear,PS2106,111.0
3,New Moon Books,Prolonged Data Deprivation: Four Case Studies,PS3333,4072.0
4,New Moon Books,Emotional Security: A New Algorithm,PS7777,3336.0

In [81]:
df2 = pd.read_sql_query('''
select au_lname, au_fname, title_id, authors.au_id as authorid
from authors 
inner join titleauthor
on authors.au_id = titleauthor.au_id;

''', engine)

In [82]:
df2.head()

  au_lname  au_fname title_id     authorid
0    White   Johnson   PS3333  172-32-1176
1    Green  Marjorie   BU1032  213-46-8915
2    Green  Marjorie   BU2075  213-46-8915
3   Carson    Cheryl   PC1035  238-95-7766
4  O'Leary   Michael   BU1111  267-41-2394

In [83]:
df3 = pd.merge(df1, df2, on = 'title_id', how ='outer')
df3.head(3)

,pub_name,title,title_id,au_lname,au_fname,authorid
0,New Moon Books,You Can Combat Computer Stress!,BU2075,Green,Marjorie,213-46-8915
1,New Moon Books,Is Anger the Enemy?,PS2091,Ringer,Anne,899-46-2035
2,New Moon Books,Is Anger the Enemy?,PS2091,Ringer,Albert,998-72-3567

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [114]:
df4 = pd.read_sql_query('''
SELECT a.au_id as 'Author ID', au_lname as 'Last Name', au_fname as 'First Name',
pub_name AS 'Publisher', COUNT(t.title_id) AS 'Title Count'
FROM authors AS a
Join titleauthor AS ta
on a.au_id = ta.au_id
JOIN titles AS t
on t.title_id = ta.title_id
JOIN publishers as p
ON t.pub_id = p.pub_id
GROUP BY p.pub_id, a.au_id;

''', engine)

In [115]:
df4.head(5)

     Author ID Last Name First Name       Publisher  Title Count
0  213-46-8915     Green   Marjorie  New Moon Books            1
1  899-46-2035    Ringer       Anne  New Moon Books            1
2  998-72-3567    Ringer     Albert  New Moon Books            2
3  172-32-1176     White    Johnson  New Moon Books            1
4  486-29-1786  Locksley   Charlene  New Moon Books            1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [ ]:
`AUTHOR ID` - the ID of the author
	* `LAST NAME` - author last name
	* `FIRST NAME` - author first name
	* `TOTAL` - total number of titles sold from this author

In [142]:
df5 = pd.read_sql_query('''
SELECT a.au_id AS 'Author Id', au_lname AS 'Last Name', au_fname AS 'First Name', SUM(s.qty) AS 'TOTAL_SALES'
FROM sales AS s
JOIN titles AS t
on s.title_id = t.title_id
JOIN titleauthor as ta
on ta.title_id = t.title_id
JOIN authors as a
on a.au_id = ta.au_id
group by a.au_id, a.au_fname, a.au_lname
ORDER BY SUM(qty) DESC
LIMIT 3;
''', engine)

In [143]:
df5.head(3)

     Author Id Last Name First Name  TOTAL_SALES
0  899-46-2035    Ringer       Anne        148.0
1  998-72-3567    Ringer     Albert        133.0
2  213-46-8915     Green   Marjorie         50.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [146]:
df6 = pd.read_sql_query('''
SELECT a.au_id AS 'Author Id', au_lname AS 'Last Name', au_fname AS 'First Name', ifnull(SUM(s.qty),0) AS 'TOTAL_SALES'
FROM sales AS s
JOIN titles AS t
on s.title_id = t.title_id
JOIN titleauthor as ta
on ta.title_id = t.title_id
JOIN authors as a
on a.au_id = ta.au_id
group by a.au_id, a.au_fname, a.au_lname
ORDER BY ifnull(SUM(qty), 0) DESC
LIMIT 23
; 
''', engine)

In [147]:
df6.head(20)

      Author Id       Last Name First Name  TOTAL_SALES
0   899-46-2035          Ringer       Anne        148.0
1   998-72-3567          Ringer     Albert        133.0
2   213-46-8915           Green   Marjorie         50.0
3   427-17-2319            Dull        Ann         50.0
4   846-92-7186          Hunter     Sheryl         50.0
5   267-41-2394         O'Leary    Michael         45.0
6   724-80-9391      MacFeather    Stearns         45.0
7   807-91-6654        Panteley     Sylvia         40.0
8   722-51-5454        DeFrance     Michel         40.0
9   238-95-7766          Carson     Cheryl         30.0
10  486-29-1786        Locksley   Charlene         25.0
11  648-92-1872  Blotchet-Halls   Reginald         20.0
12  472-27-2349      Gringlesby       Burt         20.0
13  672-71-3249        Yokomoto      Akiko         20.0
14  756-30-7391          Karsen      Livia         20.0
15  409-56-7008          Bennet    Abraham         15.0
16  172-32-1176           White    Johnson         15.0
17  274-80-9391        Straight       Dean         15.0
18  712-45-1867    del Castillo      Innes         10.0

## Bonus Challenge - Most Profiting Authors